src/main/resources/request/SendUpdateVisitHeaderRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsMessages.xsd" xmlns:vis1="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendUpdateVisitHeaderRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:UpdateVisitHeaderRequest>
                <vis:Identity>
                    <!--Optional:-->
                    <vis1:Guid>?</vis1:Guid>
                    <vis1:WorkType>?</vis1:WorkType>
                    <vis1:User>
                        <!--Optional:-->
                        <com:Attributes>
                            <!--Zero or more repetitions:-->
                            <com:Attribute>
                                <!--Optional:-->
                                <com:Name>?</com:Name>
                                <!--Optional:-->
                                <com:Value>?</com:Value>
                            </com:Attribute>
                        </com:Attributes>
                        <!--Optional:-->
                        <com:ID>?</com:ID>
                        <!--Optional:-->
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:DeviceID>?</com:DeviceID>
                    </vis1:User>
                    <!--Optional:-->
                    <vis1:Company>?</vis1:Company>
                    <vis1:Reference>?</vis1:Reference>
                </vis:Identity>
                <!--Optional:-->
                <vis:ClientReference>?</vis:ClientReference>
                <!--Optional:-->
                <vis:Description>?</vis:Description>
                <!--Optional:-->
                <vis:Property>
                    <!--Optional:-->
                    <com:Reference>?</com:Reference>
                    <!--Optional:-->
                    <com:ParentReference>?</com:ParentReference>
                    <!--Optional:-->
                    <com:Name>?</com:Name>
                    <!--Optional:-->
                    <com:Title>?</com:Title>
                    <!--Optional:-->
                    <com:Address>
                        <!--Optional:-->
                        <com:Name>?</com:Name>
                        <com:Lines>
                            <!--Zero or more repetitions:-->
                            <com:AddressLine>?</com:AddressLine>
                        </com:Lines>
                        <!--Optional:-->
                        <com:PostCode>?</com:PostCode>
                        <!--Optional:-->
                        <com:GeoX>?</com:GeoX>
                        <!--Optional:-->
                        <com:GeoY>?</com:GeoY>
                    </com:Address>
                    <!--Optional:-->
                    <com:Phone>?</com:Phone>
                    <!--Optional:-->
                    <com:WorkPhone>?</com:WorkPhone>
                    <!--Optional:-->
                    <com:MobilePhone>?</com:MobilePhone>
                    <!--Optional:-->
                    <com:Email>?</com:Email>
                    <!--Optional:-->
                    <com:URL>?</com:URL>
                    <!--Optional:-->
                    <com:ExtendedProperties>
                        <!--Optional:-->
                        <com:PreferredName>?</com:PreferredName>
                        <!--Optional:-->
                        <com:ID>?</com:ID>
                        <!--Optional:-->
                        <com:IDLabel>?</com:IDLabel>
                        <!--Optional:-->
                        <com:DateOfBirth>?</com:DateOfBirth>
                        <!--Optional:-->
                        <com:DateOfDeath>?</com:DateOfDeath>
                        <!--Optional:-->
                        <com:Gender>?</com:Gender>
                    </com:ExtendedProperties>
                </vis:Property>
                <!--Optional:-->
                <vis:PrintedDate>?</vis:PrintedDate>
                <!--Optional:-->
                <vis:ReceivedDate>?</vis:ReceivedDate>
                <!--Optional:-->
                <vis:ResponseDate>?</vis:ResponseDate>
                <!--Optional:-->
                <vis:RequiredDate>?</vis:RequiredDate>
                <!--Optional:-->
                <vis:Appointment>
                    <!--Optional:-->
                    <vis1:Date>?</vis1:Date>
                    <!--Optional:-->
                    <vis1:Slot>?</vis1:Slot>
                    <!--Optional:-->
                    <vis1:Schedule>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </vis1:Schedule>
                </vis:Appointment>
                <!--Optional:-->
                <vis:Schedule>
                    <com:StartDate>?</com:StartDate>
                    <com:EndDate>?</com:EndDate>
                </vis:Schedule>
                <!--Optional:-->
                <vis:Priority>?</vis:Priority>
                <!--Optional:-->
                <vis:Origin>?</vis:Origin>
                <!--Optional:-->
                <vis:SpecialInstructions>?</vis:SpecialInstructions>
                <!--Optional:-->
                <vis:CatalogueReference>?</vis:CatalogueReference>
                <!--Optional:-->
                <vis:AdditionalProperties>
                    <!--Zero or more repetitions:-->
                    <vis1:AdditionalProperty>
                        <vis1:Name>?</vis1:Name>
                        <vis1:Value>?</vis1:Value>
                        <!--Optional:-->
                        <vis1:AdditionalProperties/>
                    </vis1:AdditionalProperty>
                </vis:AdditionalProperties>
                <!--Optional:-->
                <vis:Duration>?</vis:Duration>
            </mes:UpdateVisitHeaderRequest>
        </mes:SendUpdateVisitHeaderRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>